In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset_main = pd.read_json("data.json")
dataset_main

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Rahim  31.0    Teacher      NaN       Dhaka
7    Rina   NaN     Doctor  72000.0     Barisal
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [3]:
dataset_main1 = dataset_main.copy()
dataset_main2 = dataset_main.copy()
dataset_main3 = dataset_main.copy()
dataset_main4 = dataset_main.copy()
dataset_main5 = dataset_main.copy()
dataset_main6 = dataset_main.copy()
dataset_main7 = dataset_main.copy()
dataset_main8 = dataset_main.copy()
dataset_main9 = dataset_main.copy()
dataset_main10 = dataset_main.copy()
dataset_main11 = dataset_main.copy()
dataset_main12 = dataset_main.copy()
dataset_main13 = dataset_main.copy()
dataset_main14 = dataset_main.copy()
dataset_main15 = dataset_main.copy()

In [4]:
print(dataset_main.head(3))

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi

In [5]:
print(dataset_main.tail(3))

    name   age profession   income        city
7   Rina   NaN     Doctor  72000.0     Barisal
8  Jamil  29.0   Engineer  60000.0  Chittagong
9  Farah  25.0   Designer  49000.0      Khulna

In [6]:
#column er nam dekha
print(dataset_main.columns)

Index(['name', 'age', 'profession', 'income', 'city'], dtype='object')

In [7]:
print(list(dataset_main.columns))

['name', 'age', 'profession', 'income', 'city']

In [8]:
#index onujayi column er num dekha
print(dataset_main.columns[2])

profession

In [9]:
#dataset er bistarito
print(dataset_main.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   age         9 non-null      float64
 2   profession  10 non-null     object
 3   income      9 non-null      float64
 4   city        10 non-null     object
dtypes: float64(2), object(3)
memory usage: 532.0+ bytes
None

In [10]:
#dataset er column and row dekha
print(dataset_main.shape)

(10, 5)

In [11]:
# data type gula dekha
print(dataset_main.dtypes)

name           object
age           float64
profession     object
income        float64
city           object
dtype: object

In [12]:
#dataframe describe
print(dataset_main.describe())

             age        income
count   9.000000      9.000000
mean   28.333333  55888.888889
std     3.391165  11836.853936
min    24.000000  39000.000000
25%    26.000000  48000.000000
50%    28.000000  55000.000000
75%    30.000000  60000.000000
max    35.000000  75000.000000

In [13]:
#dataframe er index dekha
print(dataset_main.index)

RangeIndex(start=0, stop=10, step=1)

In [14]:
#dataset er value gula dekha
print(dataset_main.values)

[['Arif' 28.0 'Engineer' 55000.0 'Dhaka']
 ['Nusrat' 24.0 'Designer' 48000.0 'Chittagong']
 ['Rafiq' 35.0 'Teacher' 39000.0 'Rajshahi']
 ['Mina' 30.0 'Doctor' 75000.0 'Dhaka']
 ['Hasan' 27.0 'Engineer' 58000.0 'Khulna']
 ['Sadia' 26.0 'Designer' 47000.0 'Sylhet']
 ['Rahim' 31.0 'Teacher' nan 'Dhaka']
 ['Rina' nan 'Doctor' 72000.0 'Barisal']
 ['Jamil' 29.0 'Engineer' 60000.0 'Chittagong']
 ['Farah' 25.0 'Designer' 49000.0 'Khulna']]

In [15]:
#শুধু নির্দিষ্ট টাইপের কলাম দেখতে চাও
print(dataset_main.select_dtypes(include='object'))

     name profession        city
0    Arif   Engineer       Dhaka
1  Nusrat   Designer  Chittagong
2   Rafiq    Teacher    Rajshahi
3    Mina     Doctor       Dhaka
4   Hasan   Engineer      Khulna
5   Sadia   Designer      Sylhet
6   Rahim    Teacher       Dhaka
7    Rina     Doctor     Barisal
8   Jamil   Engineer  Chittagong
9   Farah   Designer      Khulna

In [16]:
print(dataset_main.select_dtypes(include='number'))

    age   income
0  28.0  55000.0
1  24.0  48000.0
2  35.0  39000.0
3  30.0  75000.0
4  27.0  58000.0
5  26.0  47000.0
6  31.0      NaN
7   NaN  72000.0
8  29.0  60000.0
9  25.0  49000.0

In [17]:
#transpose করে (row ↔ column)
print(dataset_main.T)

                   0           1         2        3         4         5  \
name            Arif      Nusrat     Rafiq     Mina     Hasan     Sadia
age             28.0        24.0      35.0     30.0      27.0      26.0
profession  Engineer    Designer   Teacher   Doctor  Engineer  Designer
income       55000.0     48000.0   39000.0  75000.0   58000.0   47000.0
city           Dhaka  Chittagong  Rajshahi    Dhaka    Khulna    Sylhet

                  6        7           8         9
name          Rahim     Rina       Jamil     Farah
age            31.0      NaN        29.0      25.0
profession  Teacher   Doctor    Engineer  Designer
income          NaN  72000.0     60000.0   49000.0
city          Dhaka  Barisal  Chittagong    Khulna

In [18]:
#মোট element (row × column) সংখ্যা
print(dataset_main.size)

50

In [19]:
#ডেটাফ্রেমের dimension (2 হলে 2D)
print(dataset_main.ndim)

2

In [20]:
#প্রতিটি কলামে কত memory লাগছে তা দেখায়
print(dataset_main.memory_usage())

Index         132
name           80
age            80
profession     80
income         80
city           80
dtype: int64

In [21]:
#র‍্যান্ডম রো দেখায়
print(dataset_main.sample())

    name   age profession   income    city
9  Farah  25.0   Designer  49000.0  Khulna

In [22]:
print(dataset_main.sample(5))

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
8   Jamil  29.0   Engineer  60000.0  Chittagong
3    Mina  30.0     Doctor  75000.0       Dhaka
6   Rahim  31.0    Teacher      NaN       Dhaka

In [23]:
#কোন মান NaN তা True/False আকারে দেয়
print(dataset_main.isnull())

    name    age  profession  income   city
0  False  False       False   False  False
1  False  False       False   False  False
2  False  False       False   False  False
3  False  False       False   False  False
4  False  False       False   False  False
5  False  False       False   False  False
6  False  False       False    True  False
7  False   True       False   False  False
8  False  False       False   False  False
9  False  False       False   False  False

In [24]:
#Missing না হলে True দেয়
print(dataset_main.notnull())

   name    age  profession  income  city
0  True   True        True    True  True
1  True   True        True    True  True
2  True   True        True    True  True
3  True   True        True    True  True
4  True   True        True    True  True
5  True   True        True    True  True
6  True   True        True   False  True
7  True  False        True    True  True
8  True   True        True    True  True
9  True   True        True    True  True

In [25]:
#প্রতিটি কলামে unique মানের সংখ্যা
print(dataset_main.nunique())

name          10
age            9
profession     4
income         9
city           6
dtype: int64

In [26]:
#Duplicate রো চেক করে
print(dataset_main.duplicated())

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [27]:
#Duplicate রো বাদ দেয়
print(dataset_main.drop_duplicates())

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Rahim  31.0    Teacher      NaN       Dhaka
7    Rina   NaN     Doctor  72000.0     Barisal
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [28]:
#Numeric কলামগুলোর মধ্যে correlation দেখায়
numaric_dataset_main1 = dataset_main1.select_dtypes(include='number')
print(numaric_dataset_main1.corr())

             age    income
age     1.000000 -0.030318
income -0.030318  1.000000

In [29]:
#নির্দিষ্ট কলামে sort করে
print(dataset_main.sort_values('age'))

     name   age profession   income        city
1  Nusrat  24.0   Designer  48000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
4   Hasan  27.0   Engineer  58000.0      Khulna
0    Arif  28.0   Engineer  55000.0       Dhaka
8   Jamil  29.0   Engineer  60000.0  Chittagong
3    Mina  30.0     Doctor  75000.0       Dhaka
6   Rahim  31.0    Teacher      NaN       Dhaka
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
7    Rina   NaN     Doctor  72000.0     Barisal

In [30]:
#কলাম rename করে
print(dataset_main1.rename(columns=({'name':'Name','age':'Age'})))

     Name   Age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Rahim  31.0    Teacher      NaN       Dhaka
7    Rina   NaN     Doctor  72000.0     Barisal
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [31]:
#কলাম বা রো বাদ দেয়
print(dataset_main1.drop('city', axis=1))

     name   age profession   income
0    Arif  28.0   Engineer  55000.0
1  Nusrat  24.0   Designer  48000.0
2   Rafiq  35.0    Teacher  39000.0
3    Mina  30.0     Doctor  75000.0
4   Hasan  27.0   Engineer  58000.0
5   Sadia  26.0   Designer  47000.0
6   Rahim  31.0    Teacher      NaN
7    Rina   NaN     Doctor  72000.0
8   Jamil  29.0   Engineer  60000.0
9   Farah  25.0   Designer  49000.0

In [32]:
#নতুন index সেট করে
print(dataset_main1.reset_index())

   index    name   age profession   income        city
0      0    Arif  28.0   Engineer  55000.0       Dhaka
1      1  Nusrat  24.0   Designer  48000.0  Chittagong
2      2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3      3    Mina  30.0     Doctor  75000.0       Dhaka
4      4   Hasan  27.0   Engineer  58000.0      Khulna
5      5   Sadia  26.0   Designer  47000.0      Sylhet
6      6   Rahim  31.0    Teacher      NaN       Dhaka
7      7    Rina   NaN     Doctor  72000.0     Barisal
8      8   Jamil  29.0   Engineer  60000.0  Chittagong
9      9   Farah  25.0   Designer  49000.0      Khulna

In [33]:
#Group করে পরিসংখ্যান বের করে
grouped = dataset_main1.groupby('age')['income'].mean()
print(grouped)

age
24.0    48000.0
25.0    49000.0
26.0    47000.0
27.0    58000.0
28.0    55000.0
29.0    60000.0
30.0    75000.0
31.0        NaN
35.0    39000.0
Name: income, dtype: float64

In [34]:
#df.apply()
#Custom function প্রয়োগ করে

In [35]:
#Missing value পূরণ করে
print(dataset_main1.fillna(3))

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Rahim  31.0    Teacher      3.0       Dhaka
7    Rina   3.0     Doctor  72000.0     Barisal
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [36]:
#Missing value বাদ দেয়
print(dataset_main1.dropna())

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [37]:
print(dataset_main1.dropna().reset_index(drop=True))

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Jamil  29.0   Engineer  60000.0  Chittagong
7   Farah  25.0   Designer  49000.0      Khulna

In [38]:
print(dataset_main1.to_csv())

,name,age,profession,income,city
0,Arif,28.0,Engineer,55000.0,Dhaka
1,Nusrat,24.0,Designer,48000.0,Chittagong
2,Rafiq,35.0,Teacher,39000.0,Rajshahi
3,Mina,30.0,Doctor,75000.0,Dhaka
4,Hasan,27.0,Engineer,58000.0,Khulna
5,Sadia,26.0,Designer,47000.0,Sylhet
6,Rahim,31.0,Teacher,,Dhaka
7,Rina,,Doctor,72000.0,Barisal
8,Jamil,29.0,Engineer,60000.0,Chittagong
9,Farah,25.0,Designer,49000.0,Khulna